{"backend": "tensorflow", "config": [{"config": {"kernel_regularizer": null, "trainable": true, "bias_constraint": null, "batch_input_shape": [null, 784], "name": "dense_1", "units": 512, "use_bias": true, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_initializer": {"config": {"minval": -0.05, "maxval": 0.05, "seed": null}, "class_name": "RandomUniform"}, "dtype": "float32", "kernel_constraint": null, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_1"}, "class_name": "Activation"}, {"config": {"trainable": true, "rate": 0.2, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"kernel_regularizer": null, "trainable": true, "bias_constraint": null, "units": 512, "use_bias": true, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_initializer": {"config": {"minval": -0.05, "maxval": 0.05, "seed": null}, "class_name": "RandomUniform"}, "name": "dense_2", "kernel_constraint": null, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_2"}, "class_name": "Activation"}, {"config": {"trainable": true, "rate": 0.2, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"kernel_regularizer": null, "trainable": true, "bias_constraint": null, "units": 10, "use_bias": true, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_initializer": {"config": {"minval": -0.05, "maxval": 0.05, "seed": null}, "class_name": "RandomUniform"}, "name": "dense_3", "kernel_constraint": null, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"activation": "softmax", "trainable": true, "name": "activation_3"}, "class_name": "Activation"}], "class_name": "Sequential", "keras_version": "2.0.6"}