{"class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.0.3", "config": [{"class_name": "Dense", "config": {"dtype": "float32", "kernel_regularizer": null, "use_bias": true, "trainable": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "units": 512, "name": "dense_1", "activity_regularizer": null, "activation": "linear", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "batch_input_shape": [null, 784], "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_1"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "rate": 0.2}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "use_bias": true, "trainable": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "units": 512, "name": "dense_2", "activity_regularizer": null, "activation": "linear", "kernel_constraint": null, "kernel_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_2"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "rate": 0.2}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "use_bias": true, "trainable": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "units": 10, "name": "dense_3", "activity_regularizer": null, "activation": "linear", "kernel_constraint": null, "kernel_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "softmax", "name": "activation_3"}}]}